In [2]:
import pandas as pd
from datetime import datetime
from IPython.display import display
import warnings
warnings.filterwarnings("ignore")

In [3]:
from spendings import MoneySpendings

In [4]:
df = pd.read_csv("Spendings_csv.csv", parse_dates=["Date"], date_format="%d/%m/%Y")

In [5]:
test = MoneySpendings(df)

In [6]:
test.start()

In [ ]:
df = pd.read_csv("Spendings_csv.csv", parse_dates=["Date"], date_format="%d/%m/%Y")

In [9]:
test.info_by_month_manually(month="May", date_beg="10/05/2024", date_end="09/06/2024", price_apt=5700)

Spendings in May: 11613.28 sheckels
Spendings in May with the appartment: 17313.28 sheckels

                 Price
Category
Grocery        2418.92
Presents       2178.00
Restaurants    1432.90
Health         1061.00
Fuel            849.72
Home            796.60
Entertainment   730.00
Treatment       722.52
Utility bills   647.62
Beauty          480.00
Education       265.00
Parking          31.00

         Price  Price_apt
Who
Pasha  7795.17   10645.17
Alona  3818.11    6668.11